[

    {
        "name": "Darth Revan",
        "description" : "Revan, renowned as the Revanchist, dreaded as the Sith Lord Darth Revan, and honored as the Prodigal Knight, was an eminent Jedi Knight turned conquering Dark Lord of the Sith until, stripped of his true persona, he returned to the crumbling Jedi Order and helped defeat the Sith Empire he had established.",
        "img_source" : "https://vignette.wikia.nocookie.net/villains/images/d/df/DarthRevan-0.jpg/revision/latest/scale-to-width-down/310?cb=20200109190041",
        "url": "revan"
    },

    {
        "name": "Darth Malak",
        "description": "Darth Malak was a Human male who reigned as a Dark Lord of the Sith during the Jedi Civil War. Before becoming a Sith Lord, Alek was born on the planet Quelii in the Outer Rim Territories. When the Mandalorians attacked his homeworld, he escaped the battle and fled to the Galactic Republic, whose immigration records assigned the name of his home village as his surname. He was trained in the ways of the Force by the Jedi Order and was nicknamed Squint by his fellow Jedi, before eventually becoming a Jedi Knight. During the Mandalorian Wars, Alek, Revan—his closest friend and fellow Jedi Knight—and their faction of Jedi disobeyed the Jedi Council and aided the Republics war effort through scouting missions in the Outer Rim. He befriended the Jedi Padawan Zayne Carrick and, after taking the name Malak in order to avoid an arrest warrant issued by the Council, assisted Carrick in defeating the secretive Jedi Covenant. As the war progressed, Malak became a military general and gained a reputation as a headstrong warrior who recklessly charged into danger. Malak and Revan ultimately defeated the Mandalorians in the war's final battle at Malachor V and pursued the surviving Mandalorians into the Unknown Regions. However, the two Jedi encountered the Sith Emperor of the reconstituted remnants of the ancient Sith Empire and fell to the dark side of the Force under his tutelage, becoming Sith Lords.",

        "img_source": "https://giantbomb1.cbsistatic.com/uploads/original/8/89473/2159344-malak.jpg",
        "url": "malak"
   },

   {
       "name": "Darth Traya",
       "description": "The majority of the early life of the Human female Kreia is shrouded in mystery. However, it is known that she was a Jedi historian,[2] and that she had worked her way to the rank of Jedi Master, training many students. Kreia's eyesight went unused as she depended on meditations, attempting to penetrate the galaxy's mysteries. For decades, she challenged her students with difficult questions, such as whether a lightsaber was still a lightsaber if it lost its power, or if a Jedi was still a Jedi if she lost her Force powers. Her fellow Jedi, who called her teachings 'Kreias conundrums', viewed them as quaint, but Kreia's students were mystified",
       "img_source": "https://pbs.twimg.com/media/BXltiqCCEAA5P_c.jpg",
       "url": "traya"
   }
]